In [131]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [132]:
gender=pd.read_csv('gender_baseline.csv')

In [133]:
test=pd.read_csv('titanic_test.csv')
test.columns

Index(['passenger_id', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [134]:
train=pd.read_csv('titanic_train.csv')
train.columns

Index(['passenger_id', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest',
       'survived'],
      dtype='object')

In [135]:
train.describe()

,passenger_id,pclass,age,sibsp,parch,fare,body,survived
count,850.000000,850.00000,676.000000,850.000000,850.000000,849.000000,73.000000,850.000000
mean,662.816471,2.32000,29.519847,0.522353,0.382353,34.012701,165.821918,0.368235
std,380.751936,0.83853,14.562243,1.112132,0.879511,53.705779,99.068487,0.482610
min,1.000000,1.00000,0.166700,0.000000,0.000000,0.000000,4.000000,0.000000
25%,332.250000,2.00000,20.000000,0.000000,0.000000,7.895800,75.000000,0.000000
50%,676.500000,3.00000,28.000000,0.000000,0.000000,14.108300,166.000000,0.000000
75%,992.250000,3.00000,37.000000,1.000000,0.000000,31.000000,260.000000,1.000000
max,1307.000000,3.00000,80.000000,8.000000,9.000000,512.329200,328.000000,1.000000

In [136]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 850 entries, 0 to 849
Data columns (total 15 columns):
passenger_id    850 non-null int64
pclass          850 non-null int64
name            850 non-null object
sex             850 non-null object
age             676 non-null float64
sibsp           850 non-null int64
parch           850 non-null int64
ticket          850 non-null object
fare            849 non-null float64
cabin           191 non-null object
embarked        849 non-null object
boat            308 non-null object
body            73 non-null float64
home.dest       464 non-null object
survived        850 non-null int64
dtypes: float64(3), int64(5), object(7)
memory usage: 99.7+ KB

In [137]:
train.head()

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0

In [138]:
df = train.drop(['passenger_id', 'name', 'ticket', 'cabin','boat','body','home.dest'], axis=1, inplace=False)
df.head()

   pclass     sex   age  sibsp  parch     fare embarked  survived
0       3  female   NaN      0      0   7.7333        Q         1
1       3    male  38.0      0      0   8.6625        S         0
2       3  female  30.0      1      1  24.1500        S         0
3       2  female  54.0      1      3  23.0000        S         1
4       2    male  40.0      0      0  13.0000        S         0

In [139]:
df['age']=pd.to_numeric(df['age'])

In [140]:
df.isnull().sum()

pclass        0
sex           0
age         174
sibsp         0
parch         0
fare          1
embarked      1
survived      0
dtype: int64

In [141]:
df['age']=df['age'].fillna(df.age.median())

In [142]:
df.isnull().sum()

pclass      0
sex         0
age         0
sibsp       0
parch       0
fare        1
embarked    1
survived    0
dtype: int64

In [143]:
df=df.dropna()

In [144]:
df.isnull().sum()

pclass      0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
survived    0
dtype: int64

In [145]:
df['sex']=df['sex'].map({'male':0,'female':1})

In [156]:
df_dummies=pd.get_dummies(df,drop_first=True)

In [157]:
df_dummies.head()

   pclass  sex   age  sibsp  parch     fare  survived  embarked_Q  embarked_S
0       3    1  28.0      0      0   7.7333         1           1           0
1       3    0  38.0      0      0   8.6625         0           0           1
2       3    1  30.0      1      1  24.1500         0           0           1
3       2    1  54.0      1      3  23.0000         1           0           1
4       2    0  40.0      0      0  13.0000         0           0           1

In [158]:
labels=df_dummies['survived']
labels

0      1
1      0
2      0
3      1
4      0
      ..
845    0
846    0
847    1
848    0
849    0
Name: survived, Length: 848, dtype: int64

In [159]:
df_dummies.drop('survived',axis=1,inplace=True)

In [160]:
df_dummies.head()

   pclass  sex   age  sibsp  parch     fare  embarked_Q  embarked_S
0       3    1  28.0      0      0   7.7333           1           0
1       3    0  38.0      0      0   8.6625           0           1
2       3    1  30.0      1      1  24.1500           0           1
3       2    1  54.0      1      3  23.0000           0           1
4       2    0  40.0      0      0  13.0000           0           1

###  not normal data

In [161]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df_dummies,labels,test_size=0.25,random_state=42)

In [162]:
from sklearn.neighbors import KNeighborsClassifier

In [164]:
knn=KNeighborsClassifier()
clf=knn.fit(X_train,y_train)
pred=clf.predict(X_test)

In [168]:
from sklearn.metrics import f1_score
result= f1_score(y_test,pred)
f"f1 score is: {result}"

'f1 score is: 0.4935064935064935'

### min max scaling

In [169]:
from sklearn.preprocessing import MinMaxScaler,Normalizer,StandardScaler

In [175]:
scaler1=MinMaxScaler()
X_train_scaled1=scaler.fit_transform(X_train)
X_test_scaled1=scaler.transform(X_test)

In [176]:
clf_scaled1= knn.fit(X_train_scaled1,y_train)
scaled_pred1=clf_scaled1.predict(X_test_scaled1)

In [178]:
result=f1_score(y_test,scaled_pred1)
f'f1 score of min_max_scaled:{result}'

'f1 score of min_max_scaled:0.7643312101910829'

### Normalizer

In [180]:
normalizer=Normalizer()
X_train_normalized=normalizer.fit_transform(X_train)
X_test_normalized=normalizer.transform(X_test)

In [181]:
clf_normalized= knn.fit(X_train_normalized,y_train)
normalized_pred1=clf_normalized.predict(X_test_normalized)

In [183]:
result=f1_score(y_test,normalized_pred1)
f'f1 score of normalized:{result}'

'f1 score of normalized:0.6164383561643835'

### Standardscaler

In [184]:
scaler2=StandardScaler()
X_train_scaled2=scaler2.fit_transform(X_train)
X_test_scaled2=scaler2.transform(X_test)

In [185]:
clf_scaled2= knn.fit(X_train_scaled2,y_train)
scaled_pred2=clf_scaled2.predict(X_test_scaled2)

In [201]:
result=f1_score(y_test,scaled_pred2)
f'f1 score of standar_scaled:{result}'

'f1 score of standar_scaled:0.7875000000000001'

### Power transformation

In [207]:
from sklearn.preprocessing import PowerTransformer

In [209]:
yj = PowerTransformer(method="yeo-johnson")

In [211]:
X_train_yj=yj.fit(X_train).transform(X_train)
X_test_yj=yj.transform(X_test)

In [212]:
clf_transformed= knn.fit(X_train_yj,y_train)
transformed_pred=clf_transformed.predict(X_test_yj)

In [213]:
result=f1_score(y_test,transformed_pred)
f'f1 score of transformed:{result}'

'f1 score of transformed:0.7701863354037267'